scheme/sequent1.org
#+HTML_HEAD: <link rel="stylesheet" href="../asset/css/page.css" type="text/css" media="screen" />

#+title: sequent1

+ a prototype interpreter for a functional language
  which uses sequent calculus as dependent type system

+ XIE Yuheng created

#+PROPERTY: tangle sequent1.scm

* todo

  - data/print
    different var should be print differently

  - check-type
    infer-arity
    check-cover
    check-end

* helper

*** pattern match

    #+begin_src scheme
    ;; module system of guile
    ;; using http://synthcode.com/scheme/match.scm
    (use-modules (ice-9 match))
    #+end_src

*** cat & orz

    #+begin_src scheme
    ;; guile
    (define-syntax cat
      (syntax-rules ()
        [(cat (str . args))
         (format #t str . args)]
        [(cat (str . args) (str2 . args2) ...)
         (string-append
          (cat (str . args))
          (cat (str2 . args2) ...))]))

    ;; (define-syntax cat
    ;;   (syntax-rules ()
    ;;     [(cat (str . args))
    ;;      (format str . args)]
    ;;     [(cat (str . args) (str2 . args2) ...)
    ;;      (string-append
    ;;       (cat (str . args))
    ;;       (cat (str2 . args2) ...))]))

    (define-syntax orz
      (syntax-rules ()
        [(orz . body)
         (error (cat . body))]))

    (define-syntax note
      (syntax-rules ()
        [(note . body)
         '()]))
    #+end_src

*** testing

    #+begin_src scheme
    (use-modules (ice-9 pretty-print))

    (define-syntax test
      (syntax-rules ()
        [(test b1 b2)
         (if (equal? b1 b2)
           #t
           (let ()
             (cat ("\n"))
             (cat ("<test-fail-report-begin>\n"))
             (cat ("<actual-form> :\n"))
             (pretty-print (quote b1))
             (cat ("<actual-value> :\n"))
             (pretty-print b1)
             (cat ("<expect-form> :\n"))
             (pretty-print (quote b2))
             (cat ("<expect-value> :\n"))
             (pretty-print b2)
             (orz ("<test-fail-report-end>\n"))))]))
    #+end_src

*** list

    #+begin_src scheme
    (define (left-of s l)
      ;; sexp, list -> list
      (cond [(equal? s (car l)) '()]
            [else (cons (car l) (left-of s (cdr l)))]))

    (define (right-of s l)
      ;; sexp, list -> list
      (cond [(equal? s (car l)) (cdr l)]
            [else (right-of s (cdr l))]))
    #+end_src

*** string

    #+begin_src scheme
    (define (find-char c s)
      ;; char, string -> curser or #f
      (find-char/curser c s 0))

    (define (find-char/curser c s curser)
      ;; char, string, curser -> curser or #f
      (if (>= curser (string-length s))
        #f
        (let ([c0 (substring s curser (+ 1 curser))])
          (if (equal? c c0)
            curser
            (find-char/curser c s (+ 1 curser))))))
    #+end_src

* note

*** sequent

    - sequent is arrow
      which is the core data type of the language

*** form

***** form1

      - form1 =
        - form1/var =
          :var
          :var^n
        - form1/name =
          name
        - form1/arrow =
          (form1 ... -> form1 ...)
        - form1/lambda =
          (lambda form1/arrow
            form1/arrow
            ...)
        - form1/im-bind =
          (form1/var ... : form1 ...)
        - form1/ex-bind =
          (form1/var ... @ form1 ...)

