scheme/sequent1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-25 Mon 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sequent1</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="../asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
喪以不執 所執者喪 執喪相比 方死方生
</div>
<div id="content">
<h1 class="title">sequent1</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf50123f"><span class="done todo">todo</span> </a></li>
<li><a href="#orgd940f2a">helper</a>
<ul>
<li><a href="#orga5c38e3">pattern match</a></li>
<li><a href="#org1e4a4af">cat &amp; orz</a></li>
<li><a href="#org89977c8"><span class="done test">test</span> ing</a></li>
<li><a href="#org9907cd7">list</a></li>
<li><a href="#org47bd7d6">string</a></li>
</ul>
</li>
<li><a href="#orgf93b8d7"><span class="todo note">note</span> </a>
<ul>
<li><a href="#orgd75d5de">sequent</a></li>
<li><a href="#orgbce36df">form</a>
<ul>
<li><a href="#orgb3a2f27">form1</a></li>
<li><a href="#orgca03a13">form2</a></li>
<li><a href="#org46aa988">form3</a></li>
</ul>
</li>
<li><a href="#org8651be0">data</a></li>
<li><a href="#org43e2346">env</a></li>
<li><a href="#org5a922e1">meaning</a></li>
<li><a href="#orgdb9c31a">top</a>
<ul>
<li><a href="#orgc609c93">top1</a></li>
<li><a href="#orgf987a05">top2</a></li>
</ul>
</li>
<li><a href="#orga2e60de">report</a></li>
</ul>
</li>
<li><a href="#org5f4e4ee">pass</a>
<ul>
<li><a href="#org17f0341">pass1</a>
<ul>
<li><a href="#org2c417cc">pass1/arrow</a></li>
<li><a href="#orgce48b85">pass1/cedent</a></li>
<li><a href="#org769377f">predicates</a></li>
<li><a href="#org5cdd449">pass1</a></li>
<li><a href="#org97170dc">pass1/var</a></li>
<li><a href="#org7ac6833"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#orgb9b0ec5">pass2</a>
<ul>
<li><a href="#orgcf80556">pass2/arrow</a></li>
<li><a href="#orga36b7e1">pass2/cedent</a></li>
<li><a href="#orge2559b8">pass2/lambda</a></li>
<li><a href="#orgbb05fda">pass2</a></li>
<li><a href="#orge74ef89">pass2/var</a></li>
<li><a href="#org3a0e61d">pass2/bind</a></li>
<li><a href="#orga640cb3"><span class="done test">test</span> </a></li>
</ul>
</li>
<li><a href="#orgb0c8ef7"><span class="todo _gt__lt_">&gt;&lt;</span> pass3</a></li>
</ul>
</li>
<li><a href="#orgd6bb63d">apply</a>
<ul>
<li><a href="#org3e56eb7">apply/arrow</a></li>
<li><a href="#orge43c321">apply/cedent</a></li>
<li><a href="#org288503b">apply/dispatch</a></li>
<li><a href="#org47c7d75">apply/literal-arrow</a></li>
<li><a href="#org1999fd7">apply/var</a></li>
<li><a href="#org8950dc1">apply/name</a></li>
<li><a href="#orgec51715">id-&gt;ls</a></li>
</ul>
</li>
<li><a href="#org2e5cc35">unify</a>
<ul>
<li><a href="#org901aee3"><span class="todo _gt__lt_">&gt;&lt;</span> unify</a></li>
</ul>
</li>
<li><a href="#org1950186"><span class="todo _gt__lt_">&gt;&lt;</span> eva</a></li>
<li><a href="#org2e1dae8"><span class="todo _gt__lt_">&gt;&lt;</span> check</a></li>
<li><a href="#org9dec86f"><span class="todo _gt__lt_">&gt;&lt;</span> type-apply</a></li>
<li><a href="#orgac897b6"><span class="todo _gt__lt_">&gt;&lt;</span> sequent</a></li>
<li><a href="#org1f70d1f"><span class="done test">test</span> </a>
<ul>
<li><a href="#org80e9a36">natural</a></li>
<li><a href="#org50eda05">list</a></li>
<li><a href="#org4b804d">vector</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li><p>a prototype interpreter for a functional language</p><p>which uses sequent calculus as dependent type system</p></li>

<li><p>XIE Yuheng created</p></li></ul>

<div id="outline-container-orgf50123f" class="outline-2">
<h2 id="orgf50123f"><span class="done todo">todo</span> </h2>
<div class="outline-text-2" id="text-orgf50123f">
<ul class="org-ul">
<li><p>data/print</p><p>different var should be print differently</p></li>

<li><p>check-type</p><p>infer-arity</p><p>check-cover</p><p>check-end</p></li></ul>
</div>
</div>

<div id="outline-container-orgd940f2a" class="outline-2">
<h2 id="orgd940f2a">helper</h2>
<div class="outline-text-2" id="text-orgd940f2a">
</div><div id="outline-container-orga5c38e3" class="outline-3">
<h3 id="orga5c38e3">pattern match</h3>
<div class="outline-text-3" id="text-orga5c38e3">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #FF8888;">;; </span><span style="color: #FF8888;">module system of guile</span>
<span style="color: #FF8888;">;; </span><span style="color: #FF8888;">using http://synthcode.com/scheme/match.scm</span>
(use-modules (ice-9 match))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e4a4af" class="outline-3">
<h3 id="org1e4a4af">cat &amp; orz</h3>
<div class="outline-text-3" id="text-org1e4a4af">
<div class="org-src-container">

<pre class="src src-scheme"><span style="color: #FF8888;">;; </span><span style="color: #FF8888;">guile</span>
(<span style="color: #f92672; font-weight: bold;">define-syntax</span> <span style="color: #fd971f;">cat</span>
  (<span style="color: #f92672; font-weight: bold;">syntax-rules</span> ()
    [(cat (str . args))
     (format #t str . args)]
    [(cat (str . args) (str2 . args2) ...)
     (string-append
      (cat (str . args))
      (cat (str2 . args2) ...))]))

<span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(define-syntax cat</span>
<span style="color: #FF8888;">;;   </span><span style="color: #FF8888;">(syntax-rules ()</span>
<span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">[(cat (str . args))</span>
<span style="color: #FF8888;">;;      </span><span style="color: #FF8888;">(format str . args)]</span>
<span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">[(cat (str . args) (str2 . args2) ...)</span>
<span style="color: #FF8888;">;;      </span><span style="color: #FF8888;">(string-append</span>
<span style="color: #FF8888;">;;       </span><span style="color: #FF8888;">(cat (str . args))</span>
<span style="color: #FF8888;">;;       </span><span style="color: #FF8888;">(cat (str2 . args2) ...))]))</span>

(<span style="color: #f92672; font-weight: bold;">define-syntax</span> <span style="color: #fd971f;">orz</span>
  (<span style="color: #f92672; font-weight: bold;">syntax-rules</span> ()
    [(<span style="color: #f92672; font-weight: bold;">orz</span> . body)
     (<span style="color: #f92672; font-weight: bold;">error</span> (cat . body))]))

(<span style="color: #f92672; font-weight: bold;">define-syntax</span> <span style="color: #fd971f;">note</span>
  (<span style="color: #f92672; font-weight: bold;">syntax-rules</span> ()
    [(<span style="color: #f92672; font-weight: bold;">note</span> . body)
     '()]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org89977c8" class="outline-3">
<h3 id="org89977c8"><span class="done test">test</span> ing</h3>
<div class="outline-text-3" id="text-org89977c8">
<div class="org-src-container">

<pre class="src src-scheme">(use-modules (ice-9 pretty-print))

(<span style="color: #f92672; font-weight: bold;">define-syntax</span> <span style="color: #fd971f;">test</span>
  (<span style="color: #f92672; font-weight: bold;">syntax-rules</span> ()
    [(test b1 b2)
     (<span style="color: #f92672; font-weight: bold;">if</span> (equal? b1 b2)
       #t
       (<span style="color: #f92672; font-weight: bold;">let</span> ()
         (cat (<span style="color: #e6db74;">"\n"</span>))
         (cat (<span style="color: #e6db74;">"&lt;test-fail-report-begin&gt;\n"</span>))
         (cat (<span style="color: #e6db74;">"&lt;actual-form&gt; :\n"</span>))
         (pretty-print (<span style="color: #f92672; font-weight: bold;">quote</span> b1))
         (cat (<span style="color: #e6db74;">"&lt;actual-value&gt; :\n"</span>))
         (pretty-print b1)
         (cat (<span style="color: #e6db74;">"&lt;expect-form&gt; :\n"</span>))
         (pretty-print (<span style="color: #f92672; font-weight: bold;">quote</span> b2))
         (cat (<span style="color: #e6db74;">"&lt;expect-value&gt; :\n"</span>))
         (pretty-print b2)
         (<span style="color: #f92672; font-weight: bold;">orz</span> (<span style="color: #e6db74;">"&lt;test-fail-report-end&gt;\n"</span>))))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9907cd7" class="outline-3">
<h3 id="org9907cd7">list</h3>
<div class="outline-text-3" id="text-org9907cd7">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">left-of</span> s l)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">sexp, list -&gt; list</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(equal? s (car l)) '()]
        [else (cons (car l) (left-of s (cdr l)))]))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">right-of</span> s l)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">sexp, list -&gt; list</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(equal? s (car l)) (cdr l)]
        [else (right-of s (cdr l))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org47bd7d6" class="outline-3">
<h3 id="org47bd7d6">string</h3>
<div class="outline-text-3" id="text-org47bd7d6">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">find-char</span> c s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">char, string -&gt; curser or #f</span>
  (find-char/curser c s 0))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">find-char/curser</span> c s curser)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">char, string, curser -&gt; curser or #f</span>
  (<span style="color: #f92672; font-weight: bold;">if</span> (&gt;= curser (string-length s))
    #f
    (<span style="color: #f92672; font-weight: bold;">let</span> ([c0 (substring s curser (+ 1 curser))])
      (<span style="color: #f92672; font-weight: bold;">if</span> (equal? c c0)
        curser
        (find-char/curser c s (+ 1 curser))))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf93b8d7" class="outline-2">
<h2 id="orgf93b8d7"><span class="todo note">note</span> </h2>
<div class="outline-text-2" id="text-orgf93b8d7">
</div><div id="outline-container-orgd75d5de" class="outline-3">
<h3 id="orgd75d5de">sequent</h3>
<div class="outline-text-3" id="text-orgd75d5de">
<ul class="org-ul">
<li><p>sequent is arrow</p><p>which is the core data type of the language</p></li></ul>
</div>
</div>

<div id="outline-container-orgbce36df" class="outline-3">
<h3 id="orgbce36df">form</h3>
<div class="outline-text-3" id="text-orgbce36df">
</div><div id="outline-container-orgb3a2f27" class="outline-4">
<h4 id="orgb3a2f27">form1</h4>
<div class="outline-text-4" id="text-orgb3a2f27">
<ul class="org-ul">
<li><p>form1 =</p><p><ul class="org-ul"></p><p><li><p>form1/var =</p><p>:var</p><p>:var<sup>n</sup></p></li></p><p><li><p>form1/name =</p><p>name</p></li></p><p><li><p>form1/arrow =</p><p>(form1 &#x2026; -&gt; form1 &#x2026;)</p></li></p><p><li><p>form1/lambda =</p><p>(lambda form1/arrow</p><p>  form1/arrow</p><p>  &#x2026;)</p></li></p><p><li><p>form1/im-bind =</p><p>(form1/var &#x2026; : form1 &#x2026;)</p></li></p><p><li><p>form1/ex-bind =</p><p>(form1/var &#x2026; @ form1 &#x2026;)</p></li></ul></p></li></ul>
</div>
</div>
