scheme/sequent1.org
***** form2

      - form1 -pass1-> form2
        level of var is handled here

      - form2 =
        ('form2/var    (symbol level))
        ('form2/name   symbol)
        ('form2/arrow  ((form2 ...) (form2 ...)))
        ('form2/lambda (form2/arrow (form2/arrow ...)))
        ('form2/bind   ((form2/var ...) (form2 ...) leave?))
      - level = natural-number
      - leave? = 'leave | 'not-leave

***** form3

      - form2 -pass2-> form3
        id of var is handled here

      - form3 =
        ('form3/var    (id level))
        ('form3/name   symbol)
        ('form3/arrow  ((form3 ...) (form3 ...)))
        ('form3/lambda (form3/arrow (form3/arrow ...)))
        ('form3/bind   ((form3/var ...) (form3 ...) leave?))
      - id = #(symbol ls)

*** data

    - form3 -pass3-> data
      cons trunk multi proj are created here
      arity is calculated here

    - data =
      ('var    (id level))
      ('cons   (name (data ...)))
      ('arrow  ((data ...) (data ...)))
      ('lambda (arrow arity (arrow ...)))
      ('trunk  (arrow arity (arrow ...) (data ...)))
      ('multi  (arrow arity (arrow ...) (data ...)))
      ('proj   var)
    - arity = (number number)

*** env

    - env = (ds bs ns)
    - ds = (data ...)
    - bs = ((id . ls) ...)
      - ls = ((level . data) ...)
    - ns = ((name . meaning) ...)

*** meaning

    - meaning =
      ('lambda    (arrow arity (arrow ...)))
      ('cons/type (arrow arity name (name ...)))
      ('cons/data (arrow arity name name))

*** top

***** top1

      - top1 =
        ('dt ((form1/name form1/arrow) ((form1/name form1/arrow) ...)))
        ('df ((form1/name form1/arrow) (form1/arrow ...)))
        ('ap form1/arrow)

***** top2

      - top2 =
        ('top2/dt ((form2/name form2/arrow) ((form2/name form2/arrow) ...)))
        ('top2/df ((form2/name form2/arrow) (form2/arrow ...)))
        ('top2/ap form2/arrow)

*** report

    - report =
      ('fail (info ...))
      ('success (info ...) env)
    - info = <free>

* pass

*** pass1

***** pass1/arrow

      #+begin_src scheme
      (define (pass1/arrow default-level s)
        ;; default-level, form1/arrow -> form2/arrow
        (list (pass1/cedent default-level (left-of '-> s))
              (pass1/cedent default-level (right-of '-> s))))
      #+end_src

***** pass1/cedent

      #+begin_src scheme
      (define (pass1/cedent default-level s)
        ;; default-level, (form1 ...) -> (form2 ...)
        (match s
          ['() '()]
          [(h . r) (cons (pass1 default-level h)
                         (pass1/cedent default-level r))]))
      #+end_src

***** predicates

      #+begin_src scheme
      (define (form1/var? v)
        (and (symbol? v)
             (equal? ":" (substring (symbol->string v) 0 1))))

      (define (form1/name? v)
        (and (symbol? v)
             (not (eq? ":" (substring (symbol->string v) 0 1)))))

      (define (form1/arrow? v)
        (and (list? v)
             (member '-> v)))

      (define (form1/lambda? v)
        (and (list? v)
             (eq? (car v) 'lambda)))

      (define (form1/im-bind? v)
        (and (list? v)
             (member ': v)))

      (define (form1/ex-bind? v)
        (and (list? v)
             (member '@ v)))
      #+end_src

***** pass1

      #+begin_src scheme
      (define (pass1 default-level v)
        ;; default-level, form1 -> form2
        (cond [(form1/var? v)
               (list 'form2/var
                     (pass1/var default-level v))]
              [(form1/name? v)
               (list 'form2/name
                     v)]
              [(form1/arrow? v)
               (list 'form2/arrow
                     (pass1/arrow default-level v))]
              [(form1/lambda? v)
               (list 'form2/lambda
                     (list (pass1/arrow default-level (cadr v))
                           (map (lambda (x) (pass1/arrow default-level x))
                             (cddr v))))]
              [(form1/im-bind? v)
               (list 'form2/bind
                     (list (pass1/cedent 1 (left-of ': v))
                           (pass1/cedent 0 (right-of ': v))
                           'leave))]
              [(form1/ex-bind? v)
               (list 'form2/bind
                     (list (pass1/cedent 1 (left-of '@ v))
                           (pass1/cedent 0 (right-of '@ v))
                           'not-leave))]
              [else
               (orz ("pass1 can not handle sexp-form:~a" v))]))
      #+end_src

***** pass1/var

      #+begin_src scheme
      (define (pass1/var default-level v)
        ;; default-level, symbol -> form2/var
        (let* ([str (symbol->string v)]
               [cursor (find-char "^" str)])
          (if cursor
            (list (string->symbol (substring str 0 cursor))
                  (string->number (substring str (+ 1 cursor))))
            (list v default-level))))
      #+end_src

