scheme/sequent1.html

<div id="outline-container-orgca03a13" class="outline-4">
<h4 id="orgca03a13">form2</h4>
<div class="outline-text-4" id="text-orgca03a13">
<ul class="org-ul">
<li><p>form1 -pass1-&gt; form2</p><p>level of var is handled here</p></li>

<li><p>form2 =</p><p>('form2/var    (symbol level))</p><p>('form2/name   symbol)</p><p>('form2/arrow  ((form2 &#x2026;) (form2 &#x2026;)))</p><p>('form2/lambda (form2/arrow (form2/arrow &#x2026;)))</p><p>('form2/bind   ((form2/var &#x2026;) (form2 &#x2026;) leave?))</p></li>
<li><p>level = natural-number</p></li>
<li><p>leave? = 'leave | 'not-leave</p></li></ul>
</div>
</div>

<div id="outline-container-org46aa988" class="outline-4">
<h4 id="org46aa988">form3</h4>
<div class="outline-text-4" id="text-org46aa988">
<ul class="org-ul">
<li><p>form2 -pass2-&gt; form3</p><p>id of var is handled here</p></li>

<li><p>form3 =</p><p>('form3/var    (id level))</p><p>('form3/name   symbol)</p><p>('form3/arrow  ((form3 &#x2026;) (form3 &#x2026;)))</p><p>('form3/lambda (form3/arrow (form3/arrow &#x2026;)))</p><p>('form3/bind   ((form3/var &#x2026;) (form3 &#x2026;) leave?))</p></li>
<li><p>id = #(symbol ls)</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org8651be0" class="outline-3">
<h3 id="org8651be0">data</h3>
<div class="outline-text-3" id="text-org8651be0">
<ul class="org-ul">
<li><p>form3 -pass3-&gt; data</p><p>cons trunk multi proj are created here</p><p>arity is calculated here</p></li>

<li><p>data =</p><p>('var    (id level))</p><p>('cons   (name (data &#x2026;)))</p><p>('arrow  ((data &#x2026;) (data &#x2026;)))</p><p>('lambda (arrow arity (arrow &#x2026;)))</p><p>('trunk  (arrow arity (arrow &#x2026;) (data &#x2026;)))</p><p>('multi  (arrow arity (arrow &#x2026;) (data &#x2026;)))</p><p>('proj   var)</p></li>
<li><p>arity = (number number)</p></li></ul>
</div>
</div>

<div id="outline-container-org43e2346" class="outline-3">
<h3 id="org43e2346">env</h3>
<div class="outline-text-3" id="text-org43e2346">
<ul class="org-ul">
<li><p>env = (ds bs ns)</p></li>
<li><p>ds = (data &#x2026;)</p></li>
<li><p>bs = ((id . ls) &#x2026;)</p><p><ul class="org-ul"></p><p><li><p>ls = ((level . data) &#x2026;)</p></li></ul></p></li>
<li><p>ns = ((name . meaning) &#x2026;)</p></li></ul>
</div>
</div>

<div id="outline-container-org5a922e1" class="outline-3">
<h3 id="org5a922e1">meaning</h3>
<div class="outline-text-3" id="text-org5a922e1">
<ul class="org-ul">
<li><p>meaning =</p><p>('lambda    (arrow arity (arrow &#x2026;)))</p><p>('cons/type (arrow arity name (name &#x2026;)))</p><p>('cons/data (arrow arity name name))</p></li></ul>
</div>
</div>

<div id="outline-container-orgdb9c31a" class="outline-3">
<h3 id="orgdb9c31a">top</h3>
<div class="outline-text-3" id="text-orgdb9c31a">
</div><div id="outline-container-orgc609c93" class="outline-4">
<h4 id="orgc609c93">top1</h4>
<div class="outline-text-4" id="text-orgc609c93">
<ul class="org-ul">
<li><p>top1 =</p><p>('dt ((form1/name form1/arrow) ((form1/name form1/arrow) &#x2026;)))</p><p>('df ((form1/name form1/arrow) (form1/arrow &#x2026;)))</p><p>('ap form1/arrow)</p></li></ul>
</div>
</div>

<div id="outline-container-orgf987a05" class="outline-4">
<h4 id="orgf987a05">top2</h4>
<div class="outline-text-4" id="text-orgf987a05">
<ul class="org-ul">
<li><p>top2 =</p><p>('top2/dt ((form2/name form2/arrow) ((form2/name form2/arrow) &#x2026;)))</p><p>('top2/df ((form2/name form2/arrow) (form2/arrow &#x2026;)))</p><p>('top2/ap form2/arrow)</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-orga2e60de" class="outline-3">
<h3 id="orga2e60de">report</h3>
<div class="outline-text-3" id="text-orga2e60de">
<ul class="org-ul">
<li><p>report =</p><p>('fail (info &#x2026;))</p><p>('success (info &#x2026;) env)</p></li>
<li><p>info = &lt;free&gt;</p></li></ul>
</div>
</div>
</div>

<div id="outline-container-org5f4e4ee" class="outline-2">
<h2 id="org5f4e4ee">pass</h2>
<div class="outline-text-2" id="text-org5f4e4ee">
</div><div id="outline-container-org17f0341" class="outline-3">
<h3 id="org17f0341">pass1</h3>
<div class="outline-text-3" id="text-org17f0341">
</div><div id="outline-container-org2c417cc" class="outline-4">
<h4 id="org2c417cc">pass1/arrow</h4>
<div class="outline-text-4" id="text-org2c417cc">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass1/arrow</span> default-level s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">default-level, form1/arrow -&gt; form2/arrow</span>
  (list (pass1/cedent default-level (left-of '<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> s))
        (pass1/cedent default-level (right-of '<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> s))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce48b85" class="outline-4">
<h4 id="orgce48b85">pass1/cedent</h4>
<div class="outline-text-4" id="text-orgce48b85">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass1/cedent</span> default-level s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">default-level, (form1 ...) -&gt; (form2 ...)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> s
    ['() '()]
    [(h . r) (cons (pass1 default-level h)
                   (pass1/cedent default-level r))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org769377f" class="outline-4">
<h4 id="org769377f">predicates</h4>
<div class="outline-text-4" id="text-org769377f">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/var?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (symbol? v)
       (equal? <span style="color: #e6db74;">":"</span> (substring (symbol-&gt;string v) 0 1))))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/name?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (symbol? v)
       (not (eq? <span style="color: #e6db74;">":"</span> (substring (symbol-&gt;string v) 0 1)))))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/arrow?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (list? v)
       (member '<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> v)))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/lambda?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (list? v)
       (eq? (car v) 'lambda)))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/im-bind?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (list? v)
       (member ': v)))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">form1/ex-bind?</span> v)
  (<span style="color: #f92672; font-weight: bold;">and</span> (list? v)
       (member '@ v)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org5cdd449" class="outline-4">
<h4 id="org5cdd449">pass1</h4>
<div class="outline-text-4" id="text-org5cdd449">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass1</span> default-level v)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">default-level, form1 -&gt; form2</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(form1/var? v)
         (list 'form2/var
               (pass1/var default-level v))]
        [(form1/name? v)
         (list 'form2/name
               v)]
        [(form1/arrow? v)
         (list 'form2/arrow
               (pass1/arrow default-level v))]
        [(form1/lambda? v)
         (list 'form2/lambda
               (list (pass1/arrow default-level (cadr v))
                     (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass1/arrow default-level x))
                       (cddr v))))]
        [(form1/im-bind? v)
         (list 'form2/bind
               (list (pass1/cedent 1 (left-of ': v))
                     (pass1/cedent 0 (right-of ': v))
                     'leave))]
        [(form1/ex-bind? v)
         (list 'form2/bind
               (list (pass1/cedent 1 (left-of '@ v))
                     (pass1/cedent 0 (right-of '@ v))
                     'not-leave))]
        [else
         (<span style="color: #f92672; font-weight: bold;">orz</span> (<span style="color: #e6db74;">"pass1 can not handle sexp-form:~a"</span> v))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org97170dc" class="outline-4">
<h4 id="org97170dc">pass1/var</h4>
<div class="outline-text-4" id="text-org97170dc">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass1/var</span> default-level v)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">default-level, symbol -&gt; form2/var</span>
  (<span style="color: #f92672; font-weight: bold;">let*</span> ([str (symbol-&gt;string v)]
         [cursor (find-char <span style="color: #e6db74;">"^"</span> str)])
    (<span style="color: #f92672; font-weight: bold;">if</span> cursor
      (list (string-&gt;symbol (substring str 0 cursor))
            (string-&gt;number (substring str (+ 1 cursor))))
      (list v default-level))))
</pre>
</div>
</div>
</div>
