scheme/sequent1.org
***** test

      #+begin_src scheme
      (test
       (map (lambda (x) (pass1/arrow 0 x))
         '((natural natural -> natural)
           (natural natural -> (natural natural -> natural) natural)
           (:m zero -> :m)
           (:m :n succ -> :m :n recur succ)
           (:m :n succ -> :m :n (lambda (natural natural -> natural)
                                  (:m :n succ -> :m :n recur succ)
                                  (:m :n succ -> :m :n recur succ)))
           ((:t : type) :t -> type)
           ((:t @ type) :t -> type)
           ((:t^2 : type) :t -> type)
           ((:t1 :t2^2 :t3^0 : j k) :t -> type)
           ((:t^2 @ type) :t -> type)))
       '((((form2/name natural) (form2/name natural))
          ((form2/name natural)))
         (((form2/name natural) (form2/name natural))
          ((form2/arrow (((form2/name natural) (form2/name natural)) ((form2/name natural)))) (form2/name natural)))
         (((form2/var (:m 0)) (form2/name zero))
          ((form2/var (:m 0))))
         (((form2/var (:m 0)) (form2/var (:n 0)) (form2/name succ))
          ((form2/var (:m 0)) (form2/var (:n 0)) (form2/name recur) (form2/name succ)))
         (((form2/var (:m 0)) (form2/var (:n 0)) (form2/name succ))
          ((form2/var (:m 0)) (form2/var (:n 0)) (form2/lambda ((((form2/name natural) (form2/name natural)) ((form2/name natural))) ((((form2/var (:m 0)) (form2/var (:n 0)) (form2/name succ)) ((form2/var (:m 0)) (form2/var (:n 0)) (form2/name recur) (form2/name succ))) (((form2/var (:m 0)) (form2/var (:n 0)) (form2/name succ)) ((form2/var (:m 0)) (form2/var (:n 0)) (form2/name recur) (form2/name succ))))))))
         (((form2/bind (((form2/var (:t 1))) ((form2/name type)) leave)) (form2/var (:t 0)))
          ((form2/name type)))
         (((form2/bind (((form2/var (:t 1))) ((form2/name type)) not-leave)) (form2/var (:t 0)))
          ((form2/name type)))
         (((form2/bind (((form2/var (:t 2))) ((form2/name type)) leave)) (form2/var (:t 0)))
          ((form2/name type)))
         (((form2/bind (((form2/var (:t1 1)) (form2/var (:t2 2)) (form2/var (:t3 0))) ((form2/name j) (form2/name k)) leave)) (form2/var (:t 0)))
          ((form2/name type)))
         (((form2/bind (((form2/var (:t 2))) ((form2/name type)) not-leave)) (form2/var (:t 0)))
          ((form2/name type)))))
      #+end_src

*** pass2

***** pass2/arrow

      #+begin_src scheme
      (define (pass2/arrow a s)
        ;; form2/arrow, scope -> (form3/arrow scope)
        (match a
          [(ac sc)
           (match (pass2/cedent ac s)
             [(3ac s1)
              (match (pass2/cedent sc s1)
                [(3sc s2)
                 (list (list 3ac 3sc) s2)])])]))
      #+end_src

***** pass2/cedent

      #+begin_src scheme
      (define (pass2/cedent c s)
        ;; (form2 ...), scope -> ((form3 ...) scope)
        (match c
          ['() (list '() s)]
          [(h . r)
           (match (pass2 h s)
             [(3f s1)
              (match (pass2/cedent r s1)
                [(3c s2)
                 (list (cons 3f 3c) s2)])])]))
      #+end_src

***** pass2/lambda

      #+begin_src scheme
      (define (pass2/lambda l s)
        ;; form2/lambda, scope -> (form3/lambda scope)
        (match l
          [(a al)
           (list (list (pass2/arrow a s)
                       (map (lambda (x) (pass2/arrow x s))
                         al))
                 s)]))
      #+end_src

***** pass2

      #+begin_src scheme
      (define (pass2 f s)
        ;; form2, scope -> (form2 scope)
        (match f
          [('form2/var v)
           (match (pass2/var v s)
             [(v1 s1)
              (list (list 'form3/var v1) s1)])]
          [('form2/name n)
           (list (list 'form3/name n) s)]
          [('form2/arrow a)
           (match (pass2/arrow a s)
             [(a1 s1)
              (list (list 'form3/arrow a1) s1)])]
          [('form2/lambda l)
           (match (pass2/lambda l s)
             [(l1 s1)
              (list (list 'form3/lambda l1) s1)])]
          [('form2/bind b)
           (match (pass2/bind b s)
             [(b1 s1)
              (list (list 'form3/bind b1) s1)])]))
      #+end_src

***** pass2/var

      #+begin_src scheme
      (define (pass2/var v s)
        ;; form2/var, scope -> (form3/var scope)
        (match v
          [(symbol level)
           (let ([found (assq symbol s)])
             (if found
               (let ([old (cdr found)])
                 (list (list old level)
                       s))
               (let ([new (vector symbol '())])
                 (list (list new level)
                       (cons (cons symbol new) s)))))]))
      #+end_src

