scheme/sequent1.html

<div id="outline-container-org7ac6833" class="outline-4">
<h4 id="org7ac6833"><span class="done test">test</span> </h4>
<div class="outline-text-4" id="text-org7ac6833">
<div class="org-src-container">

<pre class="src src-scheme">(test
 (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass1/arrow 0 x))
   '((natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
     (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural) natural)
     (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
     (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)
     (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
                            (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)
                            (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)))
     ((<span style="color: #a6e22e;">:t</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
     ((<span style="color: #a6e22e;">:t</span> @ type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
     ((<span style="color: #a6e22e;">:t^2</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
     ((<span style="color: #a6e22e;">:t1</span> <span style="color: #a6e22e;">:t2^2</span> <span style="color: #a6e22e;">:t3^0</span> : j k) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
     ((<span style="color: #a6e22e;">:t^2</span> @ type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)))
 '((((form2/name natural) (form2/name natural))
    ((form2/name natural)))
   (((form2/name natural) (form2/name natural))
    ((form2/arrow (((form2/name natural) (form2/name natural)) ((form2/name natural)))) (form2/name natural)))
   (((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/name zero))
    ((form2/var (<span style="color: #a6e22e;">:m</span> 0))))
   (((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name succ))
    ((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name recur) (form2/name succ)))
   (((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name succ))
    ((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/lambda ((((form2/name natural) (form2/name natural)) ((form2/name natural))) ((((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name succ)) ((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name recur) (form2/name succ))) (((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name succ)) ((form2/var (<span style="color: #a6e22e;">:m</span> 0)) (form2/var (<span style="color: #a6e22e;">:n</span> 0)) (form2/name recur) (form2/name succ))))))))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t</span> 1))) ((form2/name type)) leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t</span> 1))) ((form2/name type)) not-leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t</span> 2))) ((form2/name type)) leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t1</span> 1)) (form2/var (<span style="color: #a6e22e;">:t2</span> 2)) (form2/var (<span style="color: #a6e22e;">:t3</span> 0))) ((form2/name j) (form2/name k)) leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))
   (((form2/bind (((form2/var (<span style="color: #a6e22e;">:t</span> 2))) ((form2/name type)) not-leave)) (form2/var (<span style="color: #a6e22e;">:t</span> 0)))
    ((form2/name type)))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb9b0ec5" class="outline-3">
<h3 id="orgb9b0ec5">pass2</h3>
<div class="outline-text-3" id="text-orgb9b0ec5">
</div><div id="outline-container-orgcf80556" class="outline-4">
<h4 id="orgcf80556">pass2/arrow</h4>
<div class="outline-text-4" id="text-orgcf80556">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/arrow</span> a s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2/arrow, scope -&gt; (form3/arrow scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> a
    [(ac sc)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent ac s)
       [(3ac s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent sc s1)
          [(3sc s2)
           (list (list 3ac 3sc) s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga36b7e1" class="outline-4">
<h4 id="orga36b7e1">pass2/cedent</h4>
<div class="outline-text-4" id="text-orga36b7e1">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/cedent</span> c s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(form2 ...), scope -&gt; ((form3 ...) scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> c
    ['() (list '() s)]
    [(h . r)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2 h s)
       [(3f s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent r s1)
          [(3c s2)
           (list (cons 3f 3c) s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2559b8" class="outline-4">
<h4 id="orge2559b8">pass2/lambda</h4>
<div class="outline-text-4" id="text-orge2559b8">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/lambda</span> l s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2/lambda, scope -&gt; (form3/lambda scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> l
    [(a al)
     (list (list (pass2/arrow a s)
                 (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass2/arrow x s))
                   al))
           s)]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbb05fda" class="outline-4">
<h4 id="orgbb05fda">pass2</h4>
<div class="outline-text-4" id="text-orgbb05fda">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2</span> f s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2, scope -&gt; (form2 scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> f
    [('form2/var v)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/var v s)
       [(v1 s1)
        (list (list 'form3/var v1) s1)])]
    [('form2/name n)
     (list (list 'form3/name n) s)]
    [('form2/arrow a)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/arrow a s)
       [(a1 s1)
        (list (list 'form3/arrow a1) s1)])]
    [('form2/lambda l)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/lambda l s)
       [(l1 s1)
        (list (list 'form3/lambda l1) s1)])]
    [('form2/bind b)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/bind b s)
       [(b1 s1)
        (list (list 'form3/bind b1) s1)])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge74ef89" class="outline-4">
<h4 id="orge74ef89">pass2/var</h4>
<div class="outline-text-4" id="text-orge74ef89">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/var</span> v s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2/var, scope -&gt; (form3/var scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> v
    [(symbol level)
     (<span style="color: #f92672; font-weight: bold;">let</span> ([found (assq symbol s)])
       (<span style="color: #f92672; font-weight: bold;">if</span> found
         (<span style="color: #f92672; font-weight: bold;">let</span> ([old (cdr found)])
           (list (list old level)
                 s))
         (<span style="color: #f92672; font-weight: bold;">let</span> ([new (vector symbol '())])
           (list (list new level)
                 (cons (cons symbol new) s)))))]))
</pre>
</div>
</div>
</div>
