scheme/sequent1.org
***** pass2/bind

      #+begin_src scheme
      (define (pass2/bind b s)
        ;; form2/bind, scope -> (form3/bind scope)
        (match b
          [(vs c leave?)
           (match (pass2/cedent vs s)
             [(3vs s1)
              (match (pass2/cedent c s1)
                ;; this means vars in vs can occur in c
                [(3c s2)
                 (list (list 3vs 3c leave?) s2)])])]))
      #+end_src

***** test

      #+begin_src scheme
      (test
       (map (lambda (x) (pass2/arrow x '()))
         (map (lambda (x) (pass1/arrow 0 x))
           '((natural natural -> natural)
             (natural natural -> (natural natural -> natural) natural)
             (:m zero -> :m)
             (:m :n succ -> :m :n recur succ)
             (:m :n succ -> :m :n (lambda (natural natural -> natural)
                                    (:m :n succ -> :m :n recur succ)
                                    (:m :n succ -> :m :n recur succ)))
             ((:t : type) :t -> type)
             ((:t @ type) :t -> type)
             ((:t^2 : type) :t -> type)
             ((:t1 :t2^2 :t3^0 : j k) :t -> type)
             ((:t^2 @ type) :t -> type))))
       '(((((form3/name natural) (form3/name natural)) ((form3/name natural))) ())
         ((((form3/name natural) (form3/name natural)) ((form3/arrow (((form3/name natural) (form3/name natural)) ((form3/name natural)))) (form3/name natural))) ())
         ((((form3/var (#(:m ()) 0)) (form3/name zero)) ((form3/var (#(:m ()) 0)))) ((:m . #(:m ()))))
         ((((form3/var (#(:m ()) 0)) (form3/var (#(:n ()) 0)) (form3/name succ)) ((form3/var (#(:m ()) 0)) (form3/var (#(:n ()) 0)) (form3/name recur) (form3/name succ))) ((:n . #(:n ())) (:m . #(:m ()))))
         ((((form3/var (#(:m ()) 0)) (form3/var (#(:n ()) 0)) (form3/name succ)) ((form3/var (#(:m ()) 0)) (form3/var (#(:n ()) 0)) (form3/lambda (((((form3/name natural) (form3/name natural)) ((form3/name natural))) ((:n . #(:n ())) (:m . #(:m ())))) (((((form3/var (#(:m ()) 0)) (form3/var (#(:n ()) 0)) (form3/name succ)) ((form3/var (#(:m ()) 0)) (form3/var (#(:n ()) 0)) (form3/name recur) (form3/name succ))) ((:n . #(:n ())) (:m . #(:m ())))) ((((form3/var (#(:m ()) 0)) (form3/var (#(:n ()) 0)) (form3/name succ)) ((form3/var (#(:m ()) 0)) (form3/var (#(:n ()) 0)) (form3/name recur) (form3/name succ))) ((:n . #(:n ())) (:m . #(:m ()))))))))) ((:n . #(:n ())) (:m . #(:m ()))))
         ((((form3/bind (((form3/var (#(:t ()) 1))) ((form3/name type)) leave)) (form3/var (#(:t ()) 0))) ((form3/name type))) ((:t . #(:t ()))))
         ((((form3/bind (((form3/var (#(:t ()) 1))) ((form3/name type)) not-leave)) (form3/var (#(:t ()) 0))) ((form3/name type))) ((:t . #(:t ()))))
         ((((form3/bind (((form3/var (#(:t ()) 2))) ((form3/name type)) leave)) (form3/var (#(:t ()) 0))) ((form3/name type))) ((:t . #(:t ()))))
         ((((form3/bind (((form3/var (#(:t1 ()) 1)) (form3/var (#(:t2 ()) 2)) (form3/var (#(:t3 ()) 0))) ((form3/name j) (form3/name k)) leave)) (form3/var (#(:t ()) 0))) ((form3/name type))) ((:t . #(:t ())) (:t3 . #(:t3 ())) (:t2 . #(:t2 ())) (:t1 . #(:t1 ()))))
         ((((form3/bind (((form3/var (#(:t ()) 2))) ((form3/name type)) not-leave)) (form3/var (#(:t ()) 0))) ((form3/name type))) ((:t . #(:t ()))))))
      #+end_src

*** >< pass3

* apply

