scheme/sequent1.html

<div id="outline-container-org3a0e61d" class="outline-4">
<h4 id="org3a0e61d">pass2/bind</h4>
<div class="outline-text-4" id="text-org3a0e61d">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">pass2/bind</span> b s)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form2/bind, scope -&gt; (form3/bind scope)</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> b
    [(vs c leave?)
     (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent vs s)
       [(3vs s1)
        (<span style="color: #f92672; font-weight: bold;">match</span> (pass2/cedent c s1)
          <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">this means vars in vs can occur in c</span>
          [(3c s2)
           (list (list 3vs 3c leave?) s2)])])]))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga640cb3" class="outline-4">
<h4 id="orga640cb3"><span class="done test">test</span> </h4>
<div class="outline-text-4" id="text-orga640cb3">
<div class="org-src-container">

<pre class="src src-scheme">(test
 (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass2/arrow x '()))
   (<span style="color: #f92672; font-weight: bold;">map</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (x) (pass1/arrow 0 x))
     '((natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
       (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural) natural)
       (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
       (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)
       (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> (<span style="color: #f92672; font-weight: bold;">lambda</span> (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
                              (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)
                              (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> recur succ)))
       ((<span style="color: #a6e22e;">:t</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
       ((<span style="color: #a6e22e;">:t</span> @ type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
       ((<span style="color: #a6e22e;">:t^2</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
       ((<span style="color: #a6e22e;">:t1</span> <span style="color: #a6e22e;">:t2^2</span> <span style="color: #a6e22e;">:t3^0</span> : j k) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
       ((<span style="color: #a6e22e;">:t^2</span> @ type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type))))
 '(((((form3/name natural) (form3/name natural)) ((form3/name natural))) ())
   ((((form3/name natural) (form3/name natural)) ((form3/arrow (((form3/name natural) (form3/name natural)) ((form3/name natural)))) (form3/name natural))) ())
   ((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/name zero)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)))) ((<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ()))))
   ((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name succ)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name recur) (form3/name succ))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ()))))
   ((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name succ)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/lambda (((((form3/name natural) (form3/name natural)) ((form3/name natural))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ())))) (((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name succ)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name recur) (form3/name succ))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ())))) ((((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name succ)) ((form3/var (#(<span style="color: #a6e22e;">:m</span> ()) 0)) (form3/var (#(<span style="color: #a6e22e;">:n</span> ()) 0)) (form3/name recur) (form3/name succ))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ()))))))))) ((<span style="color: #a6e22e;">:n</span> . #(<span style="color: #a6e22e;">:n</span> ())) (<span style="color: #a6e22e;">:m</span> . #(<span style="color: #a6e22e;">:m</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 1))) ((form3/name type)) leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 1))) ((form3/name type)) not-leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 2))) ((form3/name type)) leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t1</span> ()) 1)) (form3/var (#(<span style="color: #a6e22e;">:t2</span> ()) 2)) (form3/var (#(<span style="color: #a6e22e;">:t3</span> ()) 0))) ((form3/name j) (form3/name k)) leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ())) (<span style="color: #a6e22e;">:t3</span> . #(<span style="color: #a6e22e;">:t3</span> ())) (<span style="color: #a6e22e;">:t2</span> . #(<span style="color: #a6e22e;">:t2</span> ())) (<span style="color: #a6e22e;">:t1</span> . #(<span style="color: #a6e22e;">:t1</span> ()))))
   ((((form3/bind (((form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 2))) ((form3/name type)) not-leave)) (form3/var (#(<span style="color: #a6e22e;">:t</span> ()) 0))) ((form3/name type))) ((<span style="color: #a6e22e;">:t</span> . #(<span style="color: #a6e22e;">:t</span> ()))))))
</pre>
</div>
</div>
</div>
</div>
