scheme/sequent1.org
*** apply/arrow

    - apply/arrow is the only function that do commit

    - it returns report instead of env or #f
      because when calling it
      it is more easy to forget to handle the #f returned

    #+begin_src scheme
    (define (apply/arrow a e)
      ;; arrow, env -> report
      (match e
        [(ds bs ns)
         (match a
           [(ac sc)
            (match (unify (lambda (e) (apply/cedent ac e))
                          (list ds
                                (cons '(commit-point) bs)
                                ns))
              [('fail info-list) ('fail info-list)]
              [('success info-list e1)
               (match (apply/cedent sc e1)
                 [(ds2 bs2 ns2)
                  (list 'success info-list
                        (list ds2 (bs/commit! bs2) ns2))])])])]))

    (define (bs/commit! bs)
      ;; bs -> bs
      ;; effect on part of bs
      (cond [(equal? '(commit-point) (car bs))
             (cdr bs)]
            [else
             (let* ([pair (car bs)]
                    [id (car pair)]
                    [ls (cdr pair)])
               (id/commit! id ls)
               (bs/commit! (cdr bs)))]))

    (define (id/commit! id ls)
      ;; id, ls -> id
      ;; effect on id
      (let ()
        (vector-set! id (append ls (vector-ref id 1)))
        id))
    #+end_src

*** apply/cedent

    #+begin_src scheme
    (define (apply/cedent c e)
      ;; cedent, env -> env
      (match c
        ['() e]
        [(h . r) (apply/cedent r (apply/dispatch h e))]))
    #+end_src

*** apply/dispatch

    #+begin_src scheme
    (define (apply/dispatch f e)
      ;; form, env -> env
      (match f
        [('var v) (apply/var v e)]
        [('name n) (apply/name n e)]
        [('arrow a) (apply/literal-arrow a e)]
        [('bind b) (apply/bind b e)]))
    #+end_src

*** apply/literal-arrow

*** apply/var

*** apply/name

*** id->ls

    #+begin_src scheme
    (define (id->ls id)
      (vector-ref id 1))
    #+end_src

* unify

*** >< unify

    #+begin_src scheme
    (define (unify e)
      ;; (env -> env), env -> unify-report
      )
    #+end_src

* >< eva

* >< check

* >< type-apply

* >< sequent

* test

*** natural

    #+begin_src scheme :tangle no
    (sequent

      (dt type (-> type))

      (dt natural (-> type)
          zero (-> natural)
          succ (natural -> natural))

      (df add (natural natural -> natural)
          (:m zero -> :m)
          (:m :n succ -> :m :n add succ))

      (df mul (natural natural -> natural)
          (:m zero -> zero)
          (:m :n succ -> :m :n mul :m add))

      (ap (->
           zero succ
           zero succ succ
           add))

      (ap (->
           zero succ succ
           zero succ succ
           mul))

      (ap (-> mul)))
    #+end_src

*** list

    #+begin_src scheme :tangle no
    (sequent

      (dt type (-> type))

      (dt natural (-> type)
          zero (-> natural)
          succ (natural -> natural))

      (df add (natural natural -> natural)
          (:m zero -> :m)
          (:m :n succ -> :m :n add succ))

      (df mul (natural natural -> natural)
          (:m zero -> zero)
          (:m :n succ -> :m :n mul :m add))

      (dt list ((:t : type) :t -> type)
          null (-> :t list)
          cons (:t list :t -> :t list))

      ;; (df map (:t1 list (:t1 -> :t2) -> :t2 list)
      ;;     (null :f -> null)
      ;;     (:l :e cons :f -> :e :f apply :l :f map cons))

      (df append (:t list :t list -> :t1 list)
          (:l null -> :l)
          (:l :r :e cons -> :l :r append :e cons))

      (ap (->
           null
           zero cons
           zero cons
           zero cons
           null
           zero cons
           zero cons
           zero cons
           append)))
    #+end_src

