scheme/sequent1.html

<div id="outline-container-orgb0c8ef7" class="outline-3">
<h3 id="orgb0c8ef7"><span class="todo _gt__lt_">&gt;&lt;</span> pass3</h3>
</div>
</div>

<div id="outline-container-orgd6bb63d" class="outline-2">
<h2 id="orgd6bb63d">apply</h2>
<div class="outline-text-2" id="text-orgd6bb63d">
</div><div id="outline-container-org3e56eb7" class="outline-3">
<h3 id="org3e56eb7">apply/arrow</h3>
<div class="outline-text-3" id="text-org3e56eb7">
<ul class="org-ul">
<li><p>apply/arrow is the only function that do commit</p></li>

<li><p>it returns report instead of env or #f</p><p>because when calling it</p><p>it is more easy to forget to handle the #f returned</p></li></ul>

<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">apply/arrow</span> a e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">arrow, env -&gt; report</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> e
    [(ds bs ns)
     (<span style="color: #f92672; font-weight: bold;">match</span> a
       [(ac sc)
        (<span style="color: #f92672; font-weight: bold;">match</span> (unify (<span style="color: #f92672; font-weight: bold;">lambda</span> (e) (apply/cedent ac e))
                      (list ds
                            (cons '(commit-point) bs)
                            ns))
          [('fail info-list) ('fail info-list)]
          [('success info-list e1)
           (<span style="color: #f92672; font-weight: bold;">match</span> (apply/cedent sc e1)
             [(ds2 bs2 ns2)
              (list 'success info-list
                    (list ds2 (bs/commit! bs2) ns2))])])])]))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">bs/commit!</span> bs)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">bs -&gt; bs</span>
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">effect on part of bs</span>
  (<span style="color: #f92672; font-weight: bold;">cond</span> [(equal? '(commit-point) (car bs))
         (cdr bs)]
        [else
         (<span style="color: #f92672; font-weight: bold;">let*</span> ([pair (car bs)]
                [id (car pair)]
                [ls (cdr pair)])
           (id/commit! id ls)
           (bs/commit! (cdr bs)))]))

(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">id/commit!</span> id ls)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">id, ls -&gt; id</span>
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">effect on id</span>
  (<span style="color: #f92672; font-weight: bold;">let</span> ()
    (<span style="color: #f92672; font-weight: bold;">vector-set!</span> id (append ls (vector-ref id 1)))
    id))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge43c321" class="outline-3">
<h3 id="orge43c321">apply/cedent</h3>
<div class="outline-text-3" id="text-orge43c321">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">apply/cedent</span> c e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">cedent, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> c
    ['() e]
    [(h . r) (apply/cedent r (apply/dispatch h e))]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org288503b" class="outline-3">
<h3 id="org288503b">apply/dispatch</h3>
<div class="outline-text-3" id="text-org288503b">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">apply/dispatch</span> f e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">form, env -&gt; env</span>
  (<span style="color: #f92672; font-weight: bold;">match</span> f
    [('var v) (apply/var v e)]
    [('name n) (apply/name n e)]
    [('arrow a) (apply/literal-arrow a e)]
    [('bind b) (apply/bind b e)]))
</pre>
</div>
</div>
</div>

<div id="outline-container-org47c7d75" class="outline-3">
<h3 id="org47c7d75">apply/literal-arrow</h3>
</div>

<div id="outline-container-org1999fd7" class="outline-3">
<h3 id="org1999fd7">apply/var</h3>
</div>

<div id="outline-container-org8950dc1" class="outline-3">
<h3 id="org8950dc1">apply/name</h3>
</div>

<div id="outline-container-orgec51715" class="outline-3">
<h3 id="orgec51715">id-&gt;ls</h3>
<div class="outline-text-3" id="text-orgec51715">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">id-&gt;ls</span> id)
  (vector-ref id 1))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2e5cc35" class="outline-2">
<h2 id="org2e5cc35">unify</h2>
<div class="outline-text-2" id="text-org2e5cc35">
</div><div id="outline-container-org901aee3" class="outline-3">
<h3 id="org901aee3"><span class="todo _gt__lt_">&gt;&lt;</span> unify</h3>
<div class="outline-text-3" id="text-org901aee3">
<div class="org-src-container">

<pre class="src src-scheme">(<span style="color: #f92672; font-weight: bold;">define</span> (<span style="color: #a6e22e;">unify</span> e)
  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(env -&gt; env), env -&gt; unify-report</span>
  )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1950186" class="outline-2">
<h2 id="org1950186"><span class="todo _gt__lt_">&gt;&lt;</span> eva</h2>
</div>

<div id="outline-container-org2e1dae8" class="outline-2">
<h2 id="org2e1dae8"><span class="todo _gt__lt_">&gt;&lt;</span> check</h2>
</div>

<div id="outline-container-org9dec86f" class="outline-2">
<h2 id="org9dec86f"><span class="todo _gt__lt_">&gt;&lt;</span> type-apply</h2>
</div>

<div id="outline-container-orgac897b6" class="outline-2">
<h2 id="orgac897b6"><span class="todo _gt__lt_">&gt;&lt;</span> sequent</h2>
</div>

<div id="outline-container-org1f70d1f" class="outline-2">
<h2 id="org1f70d1f"><span class="done test">test</span> </h2>
<div class="outline-text-2" id="text-org1f70d1f">
</div><div id="outline-container-org80e9a36" class="outline-3">
<h3 id="org80e9a36">natural</h3>
<div class="outline-text-3" id="text-org80e9a36">
<div class="org-src-container">

<pre class="src src-scheme">(sequent

  (dt type (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type))

  (dt natural (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
      zero (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      succ (natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural))

  (df add (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add succ))

  (df mul (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> zero)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> mul <span style="color: #a6e22e;">:m</span> add))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
       zero succ
       zero succ succ
       add))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
       zero succ succ
       zero succ succ
       mul))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> mul)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org50eda05" class="outline-3">
<h3 id="org50eda05">list</h3>
<div class="outline-text-3" id="text-org50eda05">
<div class="org-src-container">

<pre class="src src-scheme">(sequent

  (dt type (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type))

  (dt natural (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
      zero (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      succ (natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural))

  (df add (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span>)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> add succ))

  (df mul (natural natural <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> natural)
      (<span style="color: #a6e22e;">:m</span> zero <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> zero)
      (<span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> succ <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:m</span> <span style="color: #a6e22e;">:n</span> mul <span style="color: #a6e22e;">:m</span> add))

  (dt list ((<span style="color: #a6e22e;">:t</span> : type) <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> type)
      null (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t</span> list)
      cons (<span style="color: #a6e22e;">:t</span> list <span style="color: #a6e22e;">:t</span> <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t</span> list))

  <span style="color: #FF8888;">;; </span><span style="color: #FF8888;">(df map (:t1 list (:t1 -&gt; :t2) -&gt; :t2 list)</span>
  <span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">(null :f -&gt; null)</span>
  <span style="color: #FF8888;">;;     </span><span style="color: #FF8888;">(:l :e cons :f -&gt; :e :f apply :l :f map cons))</span>

  (df append (<span style="color: #a6e22e;">:t</span> list <span style="color: #a6e22e;">:t</span> list <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:t1</span> list)
      (<span style="color: #a6e22e;">:l</span> null <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:l</span>)
      (<span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> <span style="color: #a6e22e;">:e</span> cons <span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:l</span> <span style="color: #a6e22e;">:r</span> append <span style="color: #a6e22e;">:e</span> cons))

  (ap (<span style="color: #66d9ef; font-weight: bold;">-&gt;</span>
       null
       zero cons
       zero cons
       zero cons
       null
       zero cons
       zero cons
       zero cons
       append)))
</pre>
</div>
</div>
</div>
